porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcyVertical2D/0/K.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [0  2  0 0 0 0 0];

internalField   uniform (1e-13 0 0 0 1e-13 0 0 0 1e-13);

boundaryField
{
    
    top
    {
        type            zeroGradient;
    }

    bottume
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }


}


// ************************************************************************* //
