porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcyVertical2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
    top
    {
        type            darcyGradPressureAniso;
        value           uniform 0;
    }

    
    bottume
    {
        type            darcyGradPressureAniso;
       	value		uniform 0;
    }


    walls
     {
        
        type            darcyGradPressureAniso;
       	value		uniform 0;
     }

   frontAndBack
    {
        type            empty;
    }
   
}


// ************************************************************************* //
