porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcyVertical2D/constant/K_member
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  5.0                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
  |    \\/     M anipulation  |              
                                   |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      K_member;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



d_x	d_x [0 0 0 0 0 0 0]         (1 0 0);

d_y	d_y [0 0 0 0 0 0 0]         (0 1 0);

// ************************************************************************* //
